Repository: Mohammedgh007/vaea-mobile
Catalog: lib/view/translation/app_*.arb
Languages: ar

# appName
source: VAEA
ar: يافا

# belowVersionAlertTitle
source: Outdated App Version
ar: التطبيق غير محدث

# belowVersionAlertBody
source: The app needs to be updated to the last version.
ar: برجاء تحديث التطبيق لأحدث نسخة.

source: Update Now
ar: حدث الآن

# noInternetConnectionTitle
source: No Internet Connection
ar: لا يوجد اتصال بالانترنت

# noInternetConnectionBody
source: Please connect to the internet and try again
ar: يرجى المحاولة مره اخرى

source: Ok
ar: حسنا

source: Flexible Housing
ar: تسكين مرن

# flexibleHousingBody
source: You can find variant options whose contracts are one month long, so you can always move to another option whenever you desire.
ar: بإمكانك العثور على مساكن بعقود شهرية ، بإمكانك تغيير سكنك في آي وقت.

source: Active Community
ar: مجتمع متفاعل

# activeCommunityBody
source: Whatever your interests are, you will find variant events and activities that bond you with an inclusive community.
ar: مهما كانت اهتماماتك ، ستجد العديد من الفعاليات التي ستربطك بمجتمع من الأصدقاء .

source: Maintenance Services
ar: خدمات الصيانة

# maintenanceServicesBody
source: From house’s maintenance to car’s wash and oil change, every service you need can be requested through our app.
ar: من صيانة المنزل الى تنظيف السيارة ، يمكنك طلب خدمات الصيانة من التطبيق .

source: Sign up
ar: تسجيل حساب

# youHaveAccountAlready
source: You have an account already?
ar: هل يوجد لديك حساب؟

# youDoNotHaveAccount
source: You do not have an account?
ar: ليس لديك حساب؟

source: Sign in
ar: تسجيل الدخول

source: Registration
ar: التسجيل

source: Finish
ar: انهاء

source: Submit Request
ar: ارسال الطلب

# issueDescriptionLabel
source: Issue Description
ar: نوع المشكلة

# issueDescriptionHint
source: issue here
ar: اكتب المشكلة

# notesOptionalLabel
source: Notes (Optional)
ar: ملحوظة (اختياري)

# firstnameFieldLabel
source: First Name
ar: الإسم الشخصي

# firstNameFieldHint
source: Ahmad
ar: أحمد

# lastNameFieldLabel
source: Last Name
ar: اللقب

# lastNameFieldHint
source: Alghamdi
ar: الغامدي

# genderFieldLabel
source: Gender
ar: الجنس

# genderFieldHint
source: Select your gender
ar: اختر جنسك

source: Male
ar: ذكر

source: Female
ar: أنثى

# profileImageFieldLabel
source: Profile Image (Optional)
ar: صورة الحساب (اختياري)

# idIqamaFieldLabel
source: ID/Iqama Number
ar: رقم الهوية/الإقامة

# emailAddressFieldLabel
source: Email Address
ar: عنوان البريد الإلكتروني

# passwordFieldLabel
source: Password
ar: كلمة المرور

# confirmPasswordFieldLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# requiredFieldErrorMsg
source: This is a required field
ar: هذا الحقل مطلوب

# invalidNameErrorMsg
source: Please provide a valid name
ar: الرجاء كتابة اسم صحيح

# invalidEmailErrorMsg
source: Please provide a valid email
ar: الرجاء كتابة عنوان صحيح

# invalidIdIqamaNumberErrorMsg
source: Please provide a valid ID/Iqama number
ar: الدجاء كتابة رقم صحيح

# passwordsmustmatchErrormsg
source: Passwords must match
ar: يجب أن تكون كلميتا المرور متطابقتان

# usedEmailErrorMsg
source: This email address is used
ar: هذا العنوان قيد الإستخدام

source: Verification
ar: التحقق

# nonNumericValuesNotAllowedError
source: Please provide a numeric input of 5 digits
ar: الرجاء كتابة أرقام فقط

# provideCorrectOTPErrorMsg
source: The provided otp code is incorrect.
ar: رمز التحقق غير صحيح

# registrationOTPInstructions
source: To complete the registration, please verify the email address via providing the sent OTP code.
ar: لإكمال عملية التسجيل، يرجى كتابة رمز التحقق المرسل على عنوان البرية الإلكتروني.

source: Verify
ar: تحقق

source: Back
ar: العودة

# welcomeHomeTitle
source: Welcome Home
ar: أهلا بك في منزلك

# invalidCredentialsAlertTitle
source: Invalid Credentials
ar: البيانات غير صحيحة

# invalidCredentialsAlertBody
source: Please Provide a valid email address and a valid password
ar: الرجاء كتابة عنوان بريد إلكتروني صحيح وكلمة مرور صحيحة

source: Home
ar: المنزل

source: Let Us Welcome You Home
ar: دعنا نرحب بك في منزلك

source: Find My Home
ar: ابحث عن منزلي

source: Activities
ar: الفعاليات

source: Services
ar: الخدمات

source: Profile
ar: الحساب

source: Homes History
ar: المساكن السابقة

source: Payment
ar: وسيلة الدفع

source: Notifications
ar: التنبيهات

source: Language
ar: اللغة

source: Sign out
ar: تسجيل الخروج

# selectLanguage
source: Select a language
ar: اختر اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Select Home Type
ar: نوع المسكن

# entireHomeTitle
source: Entire Home
ar: كامل المنزل

# entireHomeSubtitle
source: Have the whole place for yourself or your group
ar: أسكن في منزلك الخاص بمفردك او مع مجموعتك

# sharedHomeTitle
source: Shared Home
ar: منزل مشترك

# sharedHomeSubtitle
source: Have a private room with a shared space to save 60%
ar: أسكن في غرفة خاصة مع منطقة مشتركة لتوفر 60%

# selectTenantGender
source: Select Tenant Category
ar: اختر تصنيف المستأجر

# maleTenantGenderTitle
source: Male Employee
ar: موظف

# maleTenantGenderSubTitle
source: It offers apartments only for male tenants
ar: يوفر هذا الخيار شقق للرجال فقط

# femaleTenantGenderTitle
source: Female Employee
ar: موظفة

# femaleTenantGenderSubTitle
source: It offers apartments only for female tenants
ar: يوفر هذا الخيار شقق للنساء فقط

source: Select The City
ar: اختر المدينة

source: Riyadh
ar: الرياض

source: Jeddah
ar: جدة

source: Khobar
ar: الخبر

source: Filters
ar: التصفية

source: HomeType
ar: نوع المنزل

source: City
ar: المدينة

source: District
ar: الحي

source: Aqiq
ar: العقيق

source: Malqa
ar: الملقا

source: Bedroom
ar: غرفة نوم

source: Bathroom
ar: حمام

source: Bedrooms
ar: غرف النوم

source: Bathrooms
ar: الحمام

source: Any
ar: الكل

source: Sorting
ar: الترتيب

source: Prices (low to high)
ar: الأسعار (من الأدنى إلى الأعلى)

source: Prices (high to low)
ar: الأسعار (من الأعلى الى الأدنى)

source: Areas (big to small)
ar: المساحات (من الأكبر الى الأصغر)

# areasSmallToBig
source: Area (small to big)
ar: المساحات (من الأصغرالى الأكبر)

source: Search
ar: بحث

source: monthly
ar: شهريا

source: SAR
ar: ريال

# districtLabel
source: District
ar: حي

source: Home Search
ar: بحث المنزل

source: No results Found
ar: لا يوجد نتائج

source: Home Details
ar: تفاصيل المنزل

source: Street
ar: شارع

source: Building
ar: مبنى

source: Location
ar: الموقع

# mUnit
source: m
ar: متر

source: Ground Floor
ar: الطابق الأرضي

source: Roof Floor
ar: الطابق العلوي

# firstFloor
source: 1st Floor
ar: الطابق الأول

# secondFloor
source: 2nd Floor
ar: الطابق الثاني

# thirdFloor
source: 3rd Floor
ar: الطابق الثالث

# forthFloor
source: 4th Floor
ar: الطابق الرابع

# unitDetails
source: Apartment Details
ar: تفاصيل الشقة

source: Facilities
ar: المميزات

source: Fully Furnished
ar: مؤثثة بالكامل

source: Fully Equipped Kitchen
ar: مطبخ مجهز بالكامل

source: Reserved Parking Lot
ar: مواقف مخصصة

source: Book
ar: حجز

# mapsTabText
source: Map
ar: الخريطة

# listTabText
source: List
ar: القائمة

source: Booking
ar: الحجز

source: Lease period
ar: مدة العقد

source: Confirmation
ar: التأكيد

source: Next
ar: التالي

source: Previous
ar: السابق

source: current
ar: الحالي

# categoryType
source: Issue Category
ar: نوع المشكلة

# roomType
source: Room
ar: الغرفة

source: Pay
ar: دفع

# period3Months
source: 3 Months
ar: 3 أشهر

# period6Months
source: 6 Months
ar: 6 أشهر

# period12Months
source: 12 Months
ar: 12 أشهر

# startingDateOfResume
source: Lease Start
ar: بداية العقد

# selectWhenToStartLease
source: Select the move in date
ar: أختر يوم النقل للمنزل

source: Lease
ar: عقد الإيجار

# moveInDate
source: Move in
ar: بداية العقد

# moveOutDate
source: Move out
ar: نهاية العقد

# accountTerminationScreenTitle
source: Account Deletion
ar: إزالة الحساب

# reasonSectionTitle
source: Reason
ar: السبب

# otpVerificationSection
source: Verification
ar: التحقق

source: Delete Account
ar: إزالة الحساب

source: Proceed
ar: متابعة

# accountTerminationAlertTitle
source: Account Deletion is not reversible
ar: لا يمكن استرجاع الحساب

# accountTerminationAlertBody
source: Once this action is completed, all your data will be deleted forever.
ar: عند إكمال إجراء إزالة الحساب ، فإن جميع بياناتك ستكون ممسوحة ولا يمكن استعادتها للأبد.

source: Reason
ar: السبب

# accountTerminationStep1Text
source: We are sorry to hear you are leaving us. Please tell us the reason, so that we improve the experience.
ar: يأسفنا مغادرتك لعائلة يافا. الرجاء تزويدنا بسبب المغادرة لتحسين خدماتنا.

# accountTerminationStep2Text
source: An otp code has been sent to your email address. Please type the code below to verify you.
ar: تم إرسال رمز تحقق لبريدك الإلكروني. يرجى كتابة الرمز للتأكد من هويتك.

# accountTerminationStep3Text
source: After clicking 'Delete Account', all data will be removed and cannot be recovered. Are you sure?
ar: بعد الضغط على الزر إزالة الحساب ، فإن جميع بياناتك ستمحى للأبد ولا يمكن استعادتها.

# roomUnitCard
source: Room
ar: للغرفة

source: Unit
ar: الشقة

# availableUnitCard
source: available units
ar: وحدات متوفرة

# outOfUnitCard
source: out of
ar: من

source: Listing Details
ar: تفاصيل الإعلان

# listingIdIs
source: Listing id
ar: رقم الإعلان

# unitFeatures
source: Unit Details
ar: تفاصيل الوحده

source: Availability
ar: التوفر

# wholeUnit
source: Whole Apartment
ar: كامل الشقة

source: Area
ar: المساحة

source: Floor
ar: الطابق

# electricityAmenity
source: Electricity
ar: الكهرباء

# waterAmenity
source: Water
ar: المياه

# internetAmenity
source: Internet
ar: الإنترنت

# parkingAmenity
source: Parking
ar: موقف

# equippedKitchenAmenity
source: Equipped Kitchen
ar: مطبخ مجهز

# privateBathroomAmenity
source: Private Bathroom
ar: حمام خاص

# furnishedBedroomAmenity
source: Furnished Bedroom
ar: غرفة مؤثثة

# securityAmenity
source: Security
ar: رجل أمن

# tvAmenity
source: TV
ar: تلفاز

# acAmenity
source: Air Conditioning
ar: مكيفات

# washerAmenity
source: Washer
ar: غسالة

# waterHeaterAmenity
source: Water Heater
ar: سخانة مياه

# pleaseFillReasonFirstBooking
source: Please tell us the reason
ar: الرجاء تزويدنا بالسبب

# pleaseCheckRefundPolicy
source: Please accept the refund policy at the bottom of the page
ar: الرجاء الموافقة على سياسة الاسترجاع ،الاستبدال أسفل الصفحة

# byCheckingHere
source: By checking here, you have accepted the
ar: بالضغط هنا، فأنت توافق على

source: Refund Policy
ar: سياسة الإستبدال والإسترجاع

# refundPolicyThat
source: that does not allow neither order's refund nor order's change after submitting the payment.
ar: التى تمنع من الإستبدال والإسترجاع بعد ارسال طلب الدفع.

source: Privacy Policy
ar: سياسة الخصوصية

# privacyPolicyBody
source: At VAEA, we care about your privacy. Quite simply, our Privacy Policy explains how VAEA collects, controls, processes, shares and protects your information along with where we gain it from and who we share it with. This policy applies to use of our mobile application / website. To access the full version, please visit us at https://rentvaea.com/privacy-policy. If you have any questions regarding this Privacy Policy, please feel free to get in touch with us at support@rentvaea.com.
ar: في VAEA ، نهتم بخصوصيتك. ببساطة، توضح سياسة الخصوصية الخاصة بـ VAEA كيفية جمع VAEA والتحكم ومعالجة ومشاركة وحماية معلوماتك بالإضافة إلى مصادر الحصول عليها وأشخاص المشاركة. تنطبق هذه السياسة على استخدام تطبيقناالمحمول/الموقعالإلكتروني. لتصفح النسخة الكاملة من سياسة الخصوصية ٫ نرجوا زيارة الموقع https://rentvaea.com/ar/privacy-policy . إذا كان لديك أي أسئلة بشأن سياسة الخصوصية هذه، ُيرجى التواصل معنا عبر البريد الإلكتروني.support@rentvaea.com

# termAndCondition
source: Terms of Use
ar: الأحكام والشروط

# refundPolicyBody
source: The policy states that rend and any change in the lease are not allowed after submitting the payment.
ar: تنص السياسة بعدم السماح للإسترداد او أي تغيير في عقد المستأجر بعد اتمام عملية الدفع.

# bookAnotherUnit
source: This unit is getting booked by someone else. Try to catch the others!!!
ar: جاري حجز الوحده من قبل مستخدم آخر ، الرجاء حجز أحد الوحدات الأخرى قبل نفاذها

source: Get Started
ar: لبندأ

# youNeedToSignUpBeforeBook
source: You need to sign up first.
ar: يجب اتمام تسجيل الحساب قبل الحجز

# signedOutSuccessfully
source: You Signed out Successfully
ar: تم تسجيل الخروج بنجاح

# youNeedToAcceptPrivacyPolicy
source: You need to accept the privacy policy first.
ar: الرجاء الموافقة على سياسة الخصوصية أولا
